#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.debian_cloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "debian_cloud_image" {
      + content_type   = "iso"
      + datastore_id   = "local"
      + file_name      = (known after apply)
      + id             = (known after apply)
      + node_name      = "pve"
      + overwrite      = true
      + size           = (known after apply)
      + upload_timeout = 600
      + url            = "https://cloud.debian.org/images/cloud/bookworm/latest/debian-12-generic-amd64.qcow2"
      + verify         = true
    }

  # proxmox_virtual_environment_vm.dev_vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "dev_vm" {
        id                      = "100"
        name                    = "dev"
      + stop_on_destroy         = false
        # (24 unchanged attributes hidden)

      ~ disk {
          ~ ssd               = false -> true
            # (8 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with proxmox_virtual_environment_vm.dev_vm,
  on debian.tf line 106, in resource "proxmox_virtual_environment_vm" "dev_vm":
 106:       server = "192.168.${var.tag}.1"

The `server` attribute is deprecated and will be removed in a future release.
Please use the `servers` attribute instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*